{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "6 entities, 10 relations, 0 tripletas\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "import json\n",
    "import pickle\n",
    "\n",
    "WIKIDATA_SPARQL_ENDPOINT = \"\"\"https://query.wikidata.org/bigdata/namespace/wdq/sparql?query=\"\"\"\n",
    "\n",
    "def get_simple_map(json, key, value):\n",
    "    \"\"\"Must receive a list of dictionaries\"\"\"\n",
    "    return [(item[key]['value'], item[value]['value'])\n",
    "               for item in json]\n",
    "\n",
    "def get_query_results(endpoint, query, mime_format):\n",
    "    headers = {\"Accept\" : mime_format}\n",
    "    return requests.get(endpoint+query, headers=headers)\n",
    "\n",
    "\n",
    "query_bne_entities = \"\"\"PREFIX wikibase: <http://wikiba.se/ontology>\n",
    "SELECT ?bne ?wikidata\n",
    "WHERE { \n",
    "    ?wikidata wdt:P950 ?bne .\n",
    "}\n",
    "LIMIT 30\n",
    "\"\"\"\n",
    "\n",
    "#res2 = get_query_results(WIKIDATA_SPARQL_ENDPOINT, query_bne_entities, \"application/json\")\n",
    "\n",
    "#map2 = get_simple_map(res2.json()['results']['bindings'],\"bne\",\"wikidata\")\n",
    "#for key,value in map2:\n",
    "#    print(key,\"\\t\",value)\n",
    "\n",
    "res3 = get_query_results(WIKIDATA_SPARQL_ENDPOINT, query2, \"application/json\")\n",
    "jsonlist = res3.json()[\"results\"][\"bindings\"]\n",
    "\n",
    "\n",
    "entities = []\n",
    "relations = []\n",
    "subs = []\n",
    "\n",
    "def add_element(element, complete_list):\n",
    "    try:\n",
    "        #Item is on the list -> you don't need to add again\n",
    "        return complete_list.index(element)\n",
    "    except ValueError:\n",
    "        # Item is not on the list -> add it and return id\n",
    "        complete_list.append(element)\n",
    "        return len(complete_list)-1\n",
    "\n",
    "def extract_entity(entity):\n",
    "    if entity[\"type\"] == \"uri\":\n",
    "        return entity[\"value\"]\n",
    "    elif entity[\"type\"] == \"literal\":\n",
    "        return entity\n",
    "    elif entity[\"type\"] == \"bnode\":\n",
    "        return entity\n",
    "\n",
    "# for triplet in jsonlist:\n",
    "#     id_obj = add_element(extract_entity(triplet[\"object\"]), entities)\n",
    "#     id_subj = add_element(extract_entity(triplet[\"subject\"]), entities)\n",
    "#     id_pred = add_element(extract_entity(triplet[\"predicate\"]), relations)\n",
    "    \n",
    "#     subs.append([id_obj, id_subj, id_pred])\n",
    "    \n",
    "    \n",
    "class Dataset():\n",
    "    WIKIDATA_ENDPOINT = \"\"\"https://query.wikidata.org/bigdata/namespace/wdq/sparql?query=\"\"\"\n",
    "    entities = []\n",
    "    relations = []\n",
    "    subs = []\n",
    "    \n",
    "    def show(self, verbose=False):\n",
    "        print(\"%d entities, %d relations, %d tripletas\" % \n",
    "              (len(self.entities), len(self.relations), len(self.subs)))\n",
    "        if verbose is True:\n",
    "            print(\"\\nEntities (%d):\" % len(self.entities))\n",
    "            for entity in self.entities:\n",
    "                print(entity)\n",
    "            print(\"\\nRelations (%d):\" % len(self.relations))\n",
    "            for relation in self.relations:\n",
    "                print(relation)\n",
    "            print(\"\\nTripletas (%d):\" % len(self.subs))\n",
    "            for sub in self.subs:\n",
    "                print(sub)\n",
    "        \n",
    "    \n",
    "    def add_element(self, element, complete_list, only_uri=False):\n",
    "        if only_uri is True and type(element) is not type(\"\"):\n",
    "            return False\n",
    "        elif element is False:\n",
    "            return False\n",
    "        \n",
    "        try:\n",
    "            # Item is on the list, return same id\n",
    "            return complete_list.index(element)\n",
    "        except ValueError:\n",
    "            # Item is not on the list, append and return id\n",
    "            complete_list.append(element)\n",
    "            return len(complete_list)-1\n",
    "        \n",
    "\n",
    "    def extract_entity(self,entity):\n",
    "        if entity[\"type\"] == \"uri\":\n",
    "            # Not all 'uri' values are valid entities\n",
    "            uri = entity[\"value\"].split('/')\n",
    "            \n",
    "            if uri[2] == 'www.wikidata.org' and (uri[3] == \"reference\" or uri[4] == \"statement\"):\n",
    "                #print (uri, \"is not an entity\")\n",
    "                return False\n",
    "            \n",
    "            else:\n",
    "                return entity[\"value\"]\n",
    "            \n",
    "        elif entity[\"type\"] == \"literal\":\n",
    "            return entity\n",
    "        elif entity[\"type\"] == \"bnode\":\n",
    "            return entity\n",
    "\n",
    "    def load_dataset_from_json(self, json, only_uri=False):\n",
    "        for triplet in jsonlist:\n",
    "            id_obj = self.add_element(self.extract_entity(triplet[\"object\"]), self.entities, only_uri=only_uri)\n",
    "            id_subj = self.add_element(self.extract_entity(triplet[\"subject\"]), self.entities, only_uri=only_uri)\n",
    "            id_pred = self.add_element(self.extract_entity(triplet[\"predicate\"]), self.relations, only_uri=only_uri)\n",
    "\n",
    "            if id_obj is False or id_subj is False or id_pred is False:\n",
    "                continue\n",
    "            else:\n",
    "                self.subs.append([id_obj, id_subj, id_pred])\n",
    "            \n",
    "    def load_dataset_from_query(self, query, only_uri=False):\n",
    "        headers = {\"Accept\" : \"application/json\"}\n",
    "        response = requests.get(self.WIKIDATA_ENDPOINT + query, headers=headers)\n",
    "        jsonlist = response.json()[\"results\"][\"bindings\"]\n",
    "        \n",
    "        self.load_dataset_from_json(jsonlist, only_uri=only_uri)\n",
    "    \n",
    "    def save_to_binary(self, filepath):\n",
    "        all_dataset = {\n",
    "            'entities': self.entities,\n",
    "            'relations': self.relations,\n",
    "            'subs': self.subs\n",
    "        }\n",
    "        try:\n",
    "            f = open(filepath, \"wb+\")\n",
    "        except Exception:\n",
    "            print(\"The path you provided is not valid\")\n",
    "            return False\n",
    "        pickle.dump(all_dataset, f)\n",
    "        f.close()\n",
    "    \n",
    "    def load_from_binary(self, filepath):\n",
    "        try:\n",
    "            f = open(filepath, \"rb\")\n",
    "        except Exception:\n",
    "            print(\"The path you provided is not valid\")\n",
    "            return False\n",
    "        all_dataset = pickle.load(f)\n",
    "        f.close()\n",
    "        \n",
    "        self.entities = all_dataset['entities']\n",
    "        self.relations = all_dataset['relations']\n",
    "        self.subs = all_dataset['subs']\n",
    "        \n",
    "    \n",
    "datos = Dataset()\n",
    "query2 = \"\"\"PREFIX wikibase: <http://wikiba.se/ontology>\n",
    "construct { ?wikidata ?predicate ?object . ?object ?predicate2 ?object2 . ?object2 ?predicate3 ?object3 }\n",
    "WHERE { ?wikidata wdt:P950 ?bne .\n",
    "?wikidata ?predicate ?object .\n",
    "?object ?predicate2 ?object2 .\n",
    "?object2 ?predicate3 ?object3\n",
    "} LIMIT 10000\n",
    "\"\"\"\n",
    "datos.load_dataset_from_query(query2, only_uri=True)\n",
    "datos.show()\n",
    "\n",
    "#datos.save_to_binary(\"aquimismo\")\n",
    "\n",
    "\n",
    "        \n",
    "#print(len(jsonlist))\n",
    "#jsonlist"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['http:', '', 'www.wikidata.org', 'entity', 'Qxxx']"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\"http://www.wikidata.org/entity/Qxxx\".split('/')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
